export type Skill = {
  id: number;
  name: string;
};

export const skillColors: Record<string, string> = {
  // Технічні
  Програмування: '#969CDC',
  'Data-аналітика': '#969CDC',

  // Творчі
  'Графічний дизайн': '#D78292',
  'UX/UI дизайн': '#D78292',
  Малювання: '#D78292',
  'Обробка фото': '#D78292',
  Фотографування: '#D78292',
  'Робота з відео-, аудіо- та світловою технікою': '#D78292',
  Озвучка: '#D78292',
  Блогерство: '#D78292',
  Меморобство: '#D78292',
  'Писати/редагувати тексти': '#D78292',

  // Менеджмент та фінанси
  Менеджмент: '#90CC99',
  'Фінансові обрахунки/облік': '#90CC99',
  'Робота з документами': '#90CC99',

  // Інше
  Комунікація: '#E3A374',
  'Маркетинг/SMM': '#E3A374',
  'Генерація ідей': '#E3A374',
  Правознавство: '#E3A374',
  Соціологія: '#E3A374',
};
